PROFILE_TEXT = ['%s %s (%s)\n%i баллов', '%s %s (%s)\n%i points', '%s %s (%s)\n%i Punkte', '\u200f%s %s (%s)\n%i נקודות', '\u200f%s %s (%s)\n%i نقاط', '%s %s (%s)\n%i 01100010']
LETS_SIGNUP = [
    'Привет!👋 Давай сначала зарегистрируемся!',
    'Hi!👋 Let\'s sign up first!',
    'Hallo!👋 Lass uns zuerst registrieren!',
    '\u200fשלום!👋 בוא נירשם קודם!',
    '\u200fمرحبا!👋 دعنا نسجل أولاً!',
    '01001000 01101001!👋 01001100 01100101 01110100 00100111 01110011 00100000 01110011 01101001 01100111 01101110 00100000 01110101 01110000 00100001'
]
LONG_TIME_NO_SEE = [
    'Давно не виделись :) \nПривет, %s!',
    'Long time no see :) \nHello, %s!',
    'Lange nicht gesehen :) \nHallo, %s!',
    '\u200fלא התראינו מזמן :) \nשלום, %s!',
    '\u200fلم نرك منذ فترة طويلة :) \nمرحباً, %s!',
    '01001100 01101111 01101110 01100111 00100000 01110100 01101001 01101101 01100101 00100000 01101110 01101111 00100000 01110011 01100101 01100101 00100000 :) \n01001000 01100101 01101100 01101100 01101111, %s!'
]
WHATS_LASTNAME = [
    'Введите Вашу фамилию',
    'Write your last name in Russian',
    'Geben Sie Ihren Nachnamen auf Russisch ein',
    '\u200fכתוב את שם המשפחה שלך ברוסית',
    '\u200fاكتب اسم عائلتك باللغة الروسية',
    '01010111 01110010 01101001 01110100 01100101 00100000 01111001 01101111 01110101 01110010 00100000 01101100 01100001 01110011 01110100 00100000 01101110 01100001 01101101 01100101'
]
ERROR_LASTNAME = [
    '❌ Пожалуйста, введите корректную фамилию на русском',
    '❌ Please enter correct lastname in Russian',
    '❌ Bitte geben Sie einen korrekten Nachnamen auf Russisch ein',
    '\u200f❌ אנא הזן שם משפחה נכון ברוסית',
    '\u200f❌ الرجاء إدخال اسم العائلة الصحيح باللغة الروسية',
    '❌ 01000101 01110010 01110010 01101111 01110010 00100000 01101001 01101110 00100000 01101100 01100001 01110011 01110100 01101110 01100001 01101101 01100101'
]
WHATS_FIRSTNAME = [
    'Введите Ваше имя',
    'Write your first name in Russian',
    'Geben Sie Ihren Vornamen auf Russisch ein',
    '\u200fכתוב את שמך הפרטי ברוסית',
    '\u200fاكتب اسمك الأول باللغة الروسية',
    '01010111 01110010 01101001 01110100 01100101 00100000 01111001 01101111 01110101 01110010 00100000 01100110 01101001 01110010 01110011 01110100 00100000 01101110 01100001 01101101 01100101'
]
ERROR_FIRSTNAME = [
    '❌ Пожалуйста, введите корректное имя на русском',
    '❌ Please enter correct firstname in Russian',
    '❌ Bitte geben Sie einen korrekten Vornamen auf Russisch ein',
    '\u200f❌ אנא הזן שם פרטי נכון ברוסית',
    '\u200f❌ الرجاء إدخال الاسم الأول الصحيح باللغة الروسية',
    '❌ 01000101 01110010 01110010 01101111 01110010 00100000 01101001 01101110 00100000 01100110 01101001 01110010 01110011 01110100 01101110 01100001 01101101 01100101'
]
WHATS_STUDENTID = [
    'Введите номер Вашего студенческого билета',
    'Input your student ID',
    'Geben Sie Ihre Studentenausweisnummer ein',
    '\u200fהזן את מספר תעודת הסטודנט שלך',
    '\u200fأدخل رقم بطاقة الطالب الخاصة بك',
    '01001001 01101110 01110000 01110101 01110100 00100000 01111001 01101111 01110101 01110010 00100000 01110011 01110100 01110101 01100100 01100101 01101110 01110100 00100000 01001001 01000100'
]
ERROR_STUDENTID = [
    '❌ Пожалуйста, введите корректный номер студенческого билета',
    '❌ Please enter a correct student ID number',
    '❌ Bitte geben Sie eine korrekte Studentenausweisnummer ein',
    '\u200f❌ אנא הזן מספר תעודת סטודנט תקין',
    '\u200f❌ الرجاء إدخال رقم بطاقة طالب صحيح',
    '❌ 01000101 01110010 01110010 01101111 01110010 00100000 01101001 01101110 00100000 01110011 01110100 01110101 01100100 01100101 01101110 01110100 00100000 01001001 01000100'
]

REGISTERED_SUCCESSFULLY = [
    '✅ Вы успешно зарегистрированы. Проверьте свой /profile',
    '✅ The registration is completed. Check your /profile',
    '✅ Die Registrierung ist abgeschlossen. Überprüfen Sie Ihr /profile',
    '\u200f✅ ההרשמה הושלמה. בדוק את ה/profile שלך',
    '\u200f✅ اكتمل التسجيل. تحقق من ملفك الشخصي /profile',
    '✅ 01010010 01100101 01100111 01101001 01110011 01110100 01110010 01100001 01110100 01101001 01101111 01101110 00100000 01110011 01110101 01100011 01100011 01100101 01110011 01110011'
]

CHOOSE_LANGUAGE = '🇷🇺 Выберите язык\n🇬🇧 Choose your language\n🇩🇪 Wählen Sie Ihre Sprache\n\u200f🇮🇱 בחר את השפה שלך\n\u200f🇸🇦 اختر لغتك\n🤖 01000011 01101000 01101111 01101111 01110011 01100101 00100000 01111001 01101111 01110101 01110010 00100000 01101100 01100001 01101110 01100111 01110101 01100001 01100111 01100101'

LANGUAGE_SWITCHED = [
    'Язык сменён на русский 🇷🇺',
    'Language has been switched to English 🇬🇧',
    'Sprache wurde zu Deutsch gewechselt 🇩🇪',
    '\u200fהשפה הוחלפה לעברית 🇮🇱',
    '\u200fتم تغيير اللغة إلى العربية 🇸🇦 الله أكبر ',
    '01001100 01100001 01101110 01100111 01110101 01100001 01100111 01100101 00100000 01110011 01110111 01101001 01110100 01100011 01101000 01100101 01100100 00100000 01110100 01101111 00100000 01100010 01101001 01101110 01100001 01110010 01111001 🤖'
]

POINTS = ['баллов', 'points', 'Punkte', '\u200fנקודות', '\u200fنقاط', '01110000 01101111 01101001 01101110 01110100 01110011']
BACK = ['🔙 Назад', '🔙 Back', '🔙 Zurück', '\u200f🔙 חזור', '\u200f🔙 رجوع', '🔙 01000010 01100001 01100011 01101011']

SIGN_UP = [
    '✍️ Записаться на секцию',
    '✍️ Sign up to section',
    '✍️ Für Sektion anmelden',
    '\u200f✍️ הירשם למדור',
    '\u200f✍️ التسجيل في القسم',
    '✍️ 01010011 01101001 01100111 01101110 00100000 01110101 01110000'
]

EDIT_PROFILE = [
    '⚙️ Редактировать профиль',
    '⚙️ Edit profile',
    '⚙️ Profil bearbeiten',
    '\u200f⚙️ ערוך פרופיל',
    '\u200f⚙️ تعديل الملف الشخصي',
    '⚙️ 01000101 01100100 01101001 01110100 00100000 01110000 01110010 01101111 01100110 01101001 01101100 01100101'
]

APPROVE_SIGNUPS = [
    '☑️ Подтвердить записи',
    '☑️ Approve signups',
    '☑️ Approve signups',
    '☑️ Approve signups',
    '☑️ Approve signups',
    '☑️ Approve signups'
]

CHOOSE_THE_DAY = [
    '🗓️ Выберите день записи',
    '🗓️ Choose the day',
    '🗓️ Wählen Sie den Tag',
    '\u200f🗓️ בחר את היום',
    '\u200f🗓️ اختر اليوم',
    '🗓️ 01000011 01101000 01101111 01101111 01110011 01100101 00100000 01110100 01101000 01100101 00100000 01100100 01100001 01111001'
]
CHOOSE_THE_PAIR = [
    '🕝 Выберите время записи',
    '🕝 Choose the time',
    '🕝 Wählen Sie die Zeit',
    '\u200f🕝 בחר את הזמן',
    '\u200f🕝 اختر الوقت',
    '🕝 01000011 01101000 01101111 01101111 01110011 01100101 00100000 01110100 01101000 01100101 00100000 01110100 01101001 01101101 01100101'
]
CHOOSE_THE_GYM = [
    'Выберите зал',
    'Choose the gym',
    'Wählen Sie die Sporthalle',
    '\u200fבחר את חדר הכושר',
    '\u200fاختر الصالة الرياضية',
    '01000011 01101000 01101111 01101111 01110011 01100101 00100000 01110100 01101000 01100101 00100000 01100111 01111001 01101101'
]
SIGNED_UP_SUCCESSFULLY = [
    '✅ Вы успешно записаны!',
    '✅ Signed up successfully!',
    '✅ Erfolgreich angemeldet!',
    '\u200f✅ נרשמת בהצלחה!',
    '\u200f✅ تم التسجيل بنجاح! إِنْ شَاءَ ٱللَّٰهُ‎',
    '✅ 01010011 01101001 01100111 01101110 01100101 01100100 00100000 01110101 01110000 00100000 01110011 01110101 01100011 01100011 01100101 01110011 01110011 01100110 01110101 01101100 01101100 01111001'
]
IF_YOU_WONT_COME = [
    'Убедительная просьба заранее освободить место, если вы передумали.',
    'Please, cancel your sign up if you change your mind.',
    'Please, cancel your sign up if you change your mind.',
    'Please, cancel your sign up if you change your mind.',
    'Please, cancel your sign up if you change your mind.',
    'Please, cancel your sign up if you change your mind.'
]
CANCEL_SIGNUP = [
    '❌Отменить запись',
    '❌Cancel sign up',
    '❌Cancel',
    '❌Cancel',
    '❌Cancel',
    '❌Cancel',
]
CANCELLED = [
    'Вы отписались от занятия 👌',
    'You\'ve unsigned up👌',
    'You\'ve unsigned up👌',
    'You\'ve unsigned up👌',
    'You\'ve unsigned up👌',
    'You\'ve unsigned up👌'
]
ALREADY_SIGNED_UP = [
    'Вы уже записаны',
    'You are already signed up',
    'You are already signed up',
    'You are already signed up',
    'You are already signed up',
    'You are already signed up',
]
CHOSEN_DAY = [
    'День',
    'Day',
    'Tag',
    '\u200fיום',
    '\u200fيوم',
    '01000100 01100001 01111001'
]
CHOSEN_PAIR = [
    'Пара',
    'Pair',
    'Paar',
    '\u200fזוג',
    '\u200fزوج',
    '01010000 01100001 01101001 01110010'
]
CHOSEN_GYM = [
    'Спортзал',
    'Gym',
    'Sporthalle',
    '\u200fחדר כושר',
    '\u200fصالة رياضية',
    '01000111 01111001 01101101'
]
FREE_SLOTS = ['мест свободно', 'free slots left', 'freie Plätze übrig', '\u200fמקומות פנויים נותרו', '\u200fأماكن متاحة متبقية', '01100110 01110010 01100101 01100101 00100000 01110011 01101100 01101111 01110100 01110011']
GYM = [
    [
        '🏀 Игровой зал',
        '🏋️ Тренировочный зал',
        '🏃 Зал фитнеса',
        '🥊 Зал бокса'
    ], 
    [
        '🏀 Game gym',
        '🏋️ Training gym',
        '🏃 Fitness gym',
        '🥊 Box gym'
    ],
    [
        '🏀 Spielhalle',
        '🏋️ Trainingshalle',
        '🏃 Fitnesshalle',
        '🥊 Boxhalle'
    ],
    [
        '\u200f🏀 אולם משחקים',
        '\u200f🏋️ אולם אימונים',
        '\u200f🏃 אולם כושר',
        '\u200f🥊 אולם אגרוף'
    ],
    [
        '\u200f🏀 صالة الألعاب',
        '\u200f🏋️ صالة التدريب',
        '\u200f🏃 صالة اللياقة البدنية',
        '\u200f🥊 صالة الملاكمة'
    ],
    [
        '🏀 01000111 01100001 01101101 01100101 00100000 01100111 01111001 01101101',
        '🏋️ 01010100 01110010 01100001 01101001 01101110 01101001 01101110 01100111 00100000 01100111 01111001 01101101',
        '🏃 01000110 01101001 01110100 01101110 01100101 01110011 01110011 00100000 01100111 01111001 01101101',
        '🥊 01000010 01101111 01111000 00100000 01100111 01111001 01101101'
    ]
]

DAYS = [
    ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'],
    ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'],
    ['Montag', 'Dienstag', 'Mittwoch', 'Donnerstag', 'Freitag', 'Samstag', 'Sonntag'],
    ['\u200fיום שני', '\u200fיום שלישי', '\u200fיום רביעי', '\u200fיום חמישי', '\u200fיום שישי', '\u200fיום שבת', '\u200fיום ראשון'],
    ['\u200fالاثنين', '\u200fالثلاثاء', '\u200fالأربعاء', '\u200fالخميس', '\u200fالجمعة', '\u200fالسبت', '\u200fالأحد'],
    ['01001101 01101111 01101110 01100100 01100001 01111001', '01010100 01110101 01100101 01110011 01100100 01100001 01111001', '01010111 01100101 01100100 01101110 01100101 01110011 01100100 01100001 01111001', '01010100 01101000 01110101 01110010 01110011 01100100 01100001 01111001', '01000110 01110010 01101001 01100100 01100001 01111001', '01010011 01100001 01110100 01110101 01110010 01100100 01100001 01111001', '01010011 01110101 01101110 01100100 01100001 01111001']
]

EDIT_FIRSTNAME = [
    'Изменить имя',
    'Edit name', 
    'Name bearbeiten',
    '\u200fשנה את השם שלך',
    '\u200fتغيير الاسم',
    '01000101 01100100 01101001 01110100 00100000 01101001 01101110 01100101'
]

EDIT_LASTNAME = [
    'Изменить фамилию',
    'Edit lastname',
    'Nachname bearbeiten', 
    '\u200fשנה את שמך האחרון',
    '\u200fتغيير الاسم الأخير',
    '01000101 01100100 01101001 01110100 00100000 01101110 01100101 01110100 01100101 01110010 01100101'
]

EDIT_STUDENTID = [
    'Изменить номер студенческого билета',
    'Edit student ID',
    'Studentenausweisnummer bearbeiten',
    '\u200fשנה את מספר תעודת הסטודנט שלך',
    '\u200fتغيير رقم بطاقة الطالب',
    '01000101 01100100 01101001 01110100 00100000 01101110 01100101 01110100 01100101 01110010 01100101'
]

EDIT_LANGUAGE = [
    '🌍 Изменить язык',
    '🌍 Change language',
    '🌍 Sprache ändern',
    '\u200f🌍 שנה את השפה שלך',
    '\u200f🌍 تغيير اللغة',
    '🌍 01000101 01100100 01101001 01110100 00100000 01101110 01100101 01110100 01100101 01110010 01100101'
]

LANGUAGES = [
    '🇷🇺 Русский',
    '🇬🇧 English', 
    '🇩🇪 Deutsch',
    '\u200f🇮🇱 עִברִית',
    '\u200f🇸🇦 العربية',
    '🤖 01000101 01100100 01101001 01110100 00100000 01101110 01100101 01110100 01100101 01110010 01100101'
]

FIRSTNAME_CHANGED = [
    '✅ Имя изменено!',
    '✅ Name has been changed!',
    '✅ Name wurde geändert!',
    '\u200f✅ שם שלך שונה!',
    '\u200f✅ تغيير الاسم!',
    '✅ 01000101 01100100 01101001 01110100 00100000 01101110 01100101 01110100 01100101 01110010 01100101'
]

LASTNAME_CHANGED = [
    '✅ Фамилия изменена!',
    '✅ Lastname has been changed!',
    '✅ Nachname wurde geändert!',
    '\u200f✅ שם משפחתך שונה!',
    '\u200f✅ تغيير الاسم الأخير!',
    '✅ 01000101 01100100 01101001 01110100 00100000 01101110 01100101 01110100 01100101 01110010 01100101'
]

STUDENTID_CHANGED = [
    '✅ Номер студенческого билета изменен!',
    '✅ Student ID has been changed!',
    '✅ Studentenausweisnummer wurde geändert!',
    '\u200f✅ מספר תעודת הסטודנט שלך שונה!',
    '\u200f✅ تغيير رقم بطاقة الطالب!',
    '✅ 01000101 01100100 01101001 01110100 00100000 01101110 01100101 01110100 01100101 01110010 01100101'
]

LANGUAGES = [
    '🇷🇺 Русский',
    '🇬🇧 English',
    '🇩🇪 Deutsch', 
    '\u200f🇮🇱 עִברִית',
    '\u200f🇸🇦 العربية',
    '🤖 01000010 01101001 01101110 01100001 01110010 01111001'
]