PROFILE_TEXT = [
    "%s %s (%s)\n%i баллов",
    "%s %s (%s)\n%i points",
    "%s %s (%s)\n%i Punkte",
    "\u200f%s %s (%s)\n%i נקודות",
    "\u200f%s %s (%s)\n%i نقاط",
]
LETS_SIGNUP = [
    "Привет!👋 Давай сначала зарегистрируемся!",
    "Hi!👋 Let's sign up first!",
    "Hallo!👋 Lass uns zuerst registrieren!",
    "\u200fשלום!👋 בוא נירשם קודם!",
    "\u200fمرحبا!👋 دعنا نسجل أولاً!",
]
LONG_TIME_NO_SEE = [
    "Давно не виделись :) \nПривет, %s!",
    "Long time no see :) \nHello, %s!",
    "Lange nicht gesehen :) \nHallo, %s!",
    "\u200fלא התראינו מזמן :) \nשלום, %s!",
    "\u200fلم نرك منذ فترة طويلة :) \nمرحباً, %s!",
]
WHATS_LASTNAME = [
    "Введите Вашу фамилию",
    "Write your last name in Russian",
    "Geben Sie Ihren Nachnamen auf Russisch ein",
    "\u200fכתוב את שם המשפחה שלך ברוסית",
    "\u200fاكتب اسم عائلتك باللغة الروسية",
]
ERROR_LASTNAME = [
    "❌ Пожалуйста, введите корректную фамилию на русском",
    "❌ Please enter correct lastname in Russian",
    "❌ Bitte geben Sie einen korrekten Nachnamen auf Russisch ein",
    "\u200f❌ אנא הזן שם משפחה נכון ברוסית",
    "\u200f❌ الرجاء إدخال اسم العائلة الصحيح باللغة الروسية",
]
WHATS_FIRSTNAME = [
    "Введите Ваше имя",
    "Write your first name in Russian",
    "Geben Sie Ihren Vornamen auf Russisch ein",
    "\u200fכתוב את שמך הפרטי ברוסית",
    "\u200fاكتب اسمك الأول باللغة الروسية",
]
ERROR_FIRSTNAME = [
    "❌ Пожалуйста, введите корректное имя на русском",
    "❌ Please enter correct firstname in Russian",
    "❌ Bitte geben Sie einen korrekten Vornamen auf Russisch ein",
    "\u200f❌ אנא הזן שם פרטי נכון ברוסית",
    "\u200f❌ الرجاء إدخال الاسم الأول الصحيح باللغة الروسية",
]
WHATS_STUDENTID = [
    "Введите номер Вашего студенческого билета",
    "Input your student ID",
    "Geben Sie Ihre Studentenausweisnummer ein",
    "\u200fהזן את מספר תעודת הסטודנט שלך",
    "\u200fأدخل رقم بطاقة الطالب الخاصة بك",
]
ERROR_STUDENTID = [
    "❌ Пожалуйста, введите корректный номер студенческого билета",
    "❌ Please enter a correct student ID number",
    "❌ Bitte geben Sie eine korrekte Studentenausweisnummer ein",
    "\u200f❌ אנא הזן מספר תעודת סטודנט תקין",
    "\u200f❌ الرجاء إدخال رقم بطاقة طالب صحيح",
]

REGISTERED_SUCCESSFULLY = [
    "✅ Вы успешно зарегистрированы. Проверьте свой /profile",
    "✅ The registration is completed. Check your /profile",
    "✅ Die Registrierung ist abgeschlossen. Überprüfen Sie Ihr /profile",
    "\u200f✅ ההרשמה הושלמה. בדוק את ה/profile שלך",
    "\u200f✅ اكتمل التسجيل. تحقق من ملفك الشخصي /profile",
]

CHOOSE_LANGUAGE = "🇷🇺 Выберите язык\n🇬🇧 Choose your language\n🇩🇪 Wählen Sie Ihre Sprache\n\u200f🇮🇱 בחר את השפה שלך\n\u200f🇸🇦 اختر لغتك"

LANGUAGE_SWITCHED = [
    "Язык сменён на русский 🇷🇺",
    "Language has been switched to English 🇬🇧",
    "Sprache wurde zu Deutsch gewechselt 🇩🇪",
    "\u200fהשפה הוחלפה לעברית 🇮🇱",
    "\u200fتم تغيير اللغة إلى العربية 🇸🇦 الله أكبر ",
]
POINTS = ["баллов", "points", "Punkte", "\u200fנקודות", "\u200fنقاط"]
BACK = ["🔙 Назад", "🔙 Back", "🔙 Zurück", "\u200f🔙 חזור", "\u200f🔙 رجوع"]
SIGN_UP = [
    "✍️ Записаться на секцию",
    "✍️ Sign up to section",
    "✍️ Für Sektion anmelden",
    "\u200f✍️ הירשם למדור",
    "\u200f✍️ التسجيل في القسم",
]
EDIT_PROFILE = [
    "⚙️ Редактировать профиль",
    "⚙️ Edit profile",
    "⚙️ Profil bearbeiten",
    "\u200f⚙️ ערוך פרופיל",
    "\u200f⚙️ تعديل الملف الشخصي",
]
APPROVE_SIGNUPS = [
    "☑️ Подтвердить записи",
    "☑️ Approve signups",
    "☑️ Zustimmung zu Anmeldungen",
    "\u200f☑️ אישור ההרשמות",
    "\u200f☑️ الموافقة على التسجيلات",
]
CHOOSE_THE_DAY = [
    "🗓️ Выберите день записи",
    "🗓️ Choose the day",
    "🗓️ Wählen Sie den Tag",
    "\u200f🗓️ בחר את היום",
    "\u200f🗓️ اختر اليوم",
]
CHOOSE_THE_PAIR = [
    "🕝 Выберите время записи",
    "🕝 Choose the time",
    "🕝 Wählen Sie die Zeit",
    "\u200f🕝 בחר את הזמן",
    "\u200f🕝 اختر الوقت",
]
CHOOSE_THE_GYM = [
    "Выберите зал",
    "Choose the gym",
    "Wählen Sie die Sporthalle",
    "\u200fבחר את חדר הכושר",
    "\u200fاختر الصالة الرياضية",
]
SIGNED_UP_SUCCESSFULLY = [
    "✅ Вы успешно записаны!",
    "✅ Signed up successfully!",
    "✅ Erfolgreich angemeldet!",
    "\u200f✅ נרשמת בהצלחה!",
    "\u200f✅ تم التسجيل بنجاح! إِنْ شَاءَ ٱللَّٰهُ‎",
]
IF_YOU_WONT_COME = [
    "Убедительная просьба заранее освободить место, если вы передумали.",
    "Please, cancel your sign up if you change your mind.",
    "Bitte stornieren Sie Ihre Anmeldung, wenn Sie Ihre Meinung ändern.",
    "\u200fאנא בטל את ההרשמה שלך אם שינית את דעתך.",
    "\u200fيرجى إلغاء التسجيل إذا غيرت رأيك.",
]
CANCEL_SIGNUP = [
    "❌ Отменить запись",
    "❌ Cancel sign up",
    "❌ Anmeldung stornieren",
    "\u200f❌ בטל הרשמה",
    "\u200f❌ إلغاء التسجيل",
]
CANCELLED = [
    "Вы отписались от занятия 👌",
    "You've unsigned up 👌",
    "Sie haben sich abgemeldet 👌",
    "\u200fביטלת את ההרשמה 👌",
    "\u200fلقد ألغيت التسجيل 👌",
]
ALREADY_SIGNED_UP = [
    "Вы уже записаны",
    "You are already signed up",
    "Sie sind bereits angemeldet",
    "\u200fאתה כבר רשום",
    "\u200fأنت مسجل بالفعل",
]
CHOSEN_DAY = ["День", "Day", "Tag", "\u200fיום", "\u200fيوم"]
CHOSEN_PAIR = ["Пара", "Pair", "Paar", "\u200fזוג", "\u200fزوج"]
CHOSEN_GYM = [
    "Спортзал",
    "Gym",
    "Sporthalle",
    "\u200fחדר כושר",
    "\u200fصالة رياضية",
]
FREE_SLOTS = [
    "мест свободно",
    "free slots left",
    "freie Plätze übrig",
    "\u200fמקומות פנויים נותרו",
    "\u200fأماكن متاحة متبقية",
]
GYM = [
    ["🏀 Игровой зал", "🏋️ Тренировочный зал", "🏃 Зал фитнеса", "🥊 Зал бокса"],
    ["🏀 Game gym", "🏋️ Training gym", "🏃 Fitness gym", "🥊 Box gym"],
    ["🏀 Spielhalle", "🏋️ Trainingshalle", "🏃 Fitnesshalle", "🥊 Boxhalle"],
    [
        "\u200f🏀 אולם משחקים",
        "\u200f🏋️ אולם אימונים",
        "\u200f🏃 אולם כושר",
        "\u200f🥊 אולם אגרוף",
    ],
    [
        "\u200f🏀 صالة الألعاب",
        "\u200f🏋️ صالة التدريب",
        "\u200f🏃 صالة اللياقة البدنية",
        "\u200f🥊 صالة الملاكمة",
    ],
]
DAYS = [
    ["Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье"],
    ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"],
    ["Montag", "Dienstag", "Mittwoch", "Donnerstag", "Freitag", "Samstag", "Sonntag"],
    [
        "\u200fיום שני",
        "\u200fיום שלישי",
        "\u200fיום רביעי",
        "\u200fיום חמישי",
        "\u200fיום שישי",
        "\u200fיום שבת",
        "\u200fיום ראשון",
    ],
    [
        "\u200fالاثنين",
        "\u200fالثلاثاء",
        "\u200fالأربعاء",
        "\u200fالخميس",
        "\u200fالجمعة",
        "\u200fالسبت",
        "\u200fالأحد",
    ],
]
EDIT_FIRSTNAME = [
    "Изменить имя",
    "Edit name",
    "Name bearbeiten",
    "\u200fשנה את השם שלך",
    "\u200fتغيير الاسم",
]
EDIT_LASTNAME = [
    "Изменить фамилию",
    "Edit lastname",
    "Nachname bearbeiten",
    "\u200fשנה את שמך האחרון",
    "\u200fتغيير الاسم الأخير",
]
EDIT_STUDENTID = [
    "Изменить номер студенческого билета",
    "Edit student ID",
    "Studentenausweisnummer bearbeiten",
    "\u200fשנה את מספר תעודת הסטודנט שלך",
    "\u200fتغيير رقم بطاقة الطالب",
]
EDIT_LANGUAGE = [
    "🌍 Изменить язык",
    "🌍 Change language",
    "🌍 Sprache ändern",
    "\u200f🌍 שנה את השפה שלך",
    "\u200f🌍 تغيير اللغة",
]
LANGUAGES = [
    "🇷🇺 Русский",
    "🇬🇧 English",
    "🇩🇪 Deutsch",
    "\u200f🇮🇱 עִברִית",
    "\u200f🇸🇦 العربية",
]
FIRSTNAME_CHANGED = [
    "✅ Имя изменено!",
    "✅ Name has been changed!",
    "✅ Name wurde geändert!",
    "\u200f✅ שם שלך שונה!",
    "\u200f✅ تغيير الاسم!",
]
LASTNAME_CHANGED = [
    "✅ Фамилия изменена!",
    "✅ Lastname has been changed!",
    "✅ Nachname wurde geändert!",
    "\u200f✅ שם משפחתך שונה!",
    "\u200f✅ تغيير الاسم الأخير!",
]
STUDENTID_CHANGED = [
    "✅ Номер студенческого билета изменен!",
    "✅ Student ID has been changed!",
    "✅ Studentenausweisnummer wurde geändert!",
    "\u200f✅ מספר תעודת הסטודנט שלך שונה!",
    "\u200f✅ تغيير رقم بطاقة الطالب!",
]
LANGUAGES = [
    "🇷🇺 Русский",
    "🇬🇧 English",
    "🇩🇪 Deutsch",
    "\u200f🇮🇱 עִברִית",
    "\u200f🇸🇦 العربية",
]
VERY_FIRST_COACH_REG = (
    "Добро пожаловать! Нажмите /reg_coach чтобы зарегистрировать тренера"
)

FIRST_NAME_COACH = "Введите имя тренера"

LAST_NAME_COACH = "Введите фамилию тренера"

PATRONYMIC_COACH = "Введите отчество тренера"

ERROR_FIRST_NAME_COACH = "Пожалуйста, введите корректное имя"

ERROR_LAST_NAME_COACH = "Пожалуйста, введите корректную фамилию"

ERROR_PATRONYMIC_COACH = "Пожалуйста, введите корректное отчество"

NO_PATRONYMIC = "Нет отчества"

IS_ADMIN_COACH = "Является ли тренер администратором? Администратор может регистрировать новых тренеров и менять залы для уже существующих"

YES_ADMIN = "Да, является"

NO_ADMIN = "Нет"

WRONG_ADMIN = "Воспользуйтесь клавиатурой, скажите, будет ли тренер администратором"

GYMS_ALLOWED = ["Игровой зал", "Тренировочный зал", "Зал фитнеса", "Зал бокса"]

FINISH_GYMS = "Готово ☀️"

GYMS_QUESTION = "Укажите залы, в которых может отмечать тренер"

GYMS_LIST = "Список залов:"

COACH_REG_FINISH = "Прекрасно! Тренер был успешно зарегистирирован. Теперь бережно передайте ссылку тренеру, он должен зайти в бота исключительно по этой ссылке, иначе он будет регистрироваться, как студент\nСсылка: https://t.me/sportmisis_bot?start=%s"

VERIFY_SECRET = "Поздравляю! Ваш аккаунт успешно верифицирован"

VERIFIED_ALREADY = "Ваш аккаунт уже был верифицирован"

EXPORT_DB = "Выгрузить базу данных"

COACH_MENU = "%s %s %s \nСписок доступных действий:"
